import React from "react";

export const Clause = () => {
  return (
    <div className="rounded-[10px] h-full w-[1080px]">
      <div className="h-14 pl-10 pr-6 flex items-center justify-between border-b border-zinc-200">
        <p className="text-sm text-neutral-950">协心编辑器服务条款</p>
      </div>
      <div className="relative h-[494px]">
        <div className="h-full py-5 px-10 font-mono overflow-auto">
          <p className="mb-4">生效日期：2024年8月6日</p>
          <p className="mb-4">
            您确认：您已经通过协心编辑器，按照服务协议的规定注册成为协心编辑器的用户（以下简称“用户”）。本商业条款（及本商业条款的不时更新，以下简称“本商业条款”）由您和本公司签订，适用于您与我们的交易（以下简称为“商业交易”），包括您向我们购买月会员、年会员、字数包以及后续提供的各项付费服务（以下简称为“付费服务”）。
          </p>
          <p className="mb-4">
            您确认：当您开始实际使用协心编辑器的任意一项付费服务时，视为您已同意本商业条款。
          </p>
          <p className="mb-4">1. 确认</p>
          <p className="mb-4">
            1.1 您确认：您已满18岁或以上，完全有能力同意本商业条款。如果您未满18岁，您将不能使用协心编辑器。
          </p>
          <p className="mb-4">
            1.2 您在与我们进行商业交易之前，已经充分阅读、理解并接受本商业条款的全部内容，点击“付款”、“我同意”、“续费”、“开通会员”等按钮或其他类似按钮，即表示您同意受本商业条款的约束。
          </p>
          <p className="mb-4">
            1.3 为改善用户体验，本公司保留随时更新或更改协心编辑器的权利。此类更新将根据我们当时的政策提供，其中可能包括自动更新或升级，而无需另行通知您。您同意对服务进行任何此类自动更新或升级。
          </p>
          <p className="mb-4">
            1.4 本公司授予您合法使用协心编辑器的个人的、有限的、可撤销的、不可转让的、非排他性的权利。本协议未明确授权的所有其他权利仍归本公司所有，您应在行使任何这些权利之前单独获得本公司的书面许可，本公司未能行使任何上述权利不构成对这些权利的放弃。
          </p>
          <p className="mb-4">
            1.5 您的账号仅限您本人使用，您应自行妥善保管、使用、维护您付费服务的账号、账号信息及密码，并采取必要和有效的保密措施，不得与他人分享账号及相关服务信息。账号共享可能会引发账号风险等级提高，从而导致账号被系统永久封停，无法解封。若由于您与他人共享账号或非本公司原因导致您的账号密码泄露，以及由于您保管、使用、维护不当而造成的损失，本公司无须承担与此有关的任何责任。
          </p>
          <p className="mb-4">
            1.6 本公司保留安排或指定其关联公司、控股公司、继任公司或经公司批准的第三方公司继续经营协心编辑器的权利。
          </p>
          <p className="mb-4">
            1.7 您付费时，我们网站公布的最新版商业条款将适用于您的交易。在您完成任何商业交易之前，请务必阅读本商业条款。如果您不同意本商业条款，您可以选择不进行商业交易；一旦您进行任何商业交易，您将受到最新版商业条款的法律约束。
          </p>
          <p className="mb-4">
            1.8 本协议适用于取代或补充原始网站的任何更新，除非更新附有单独的许可协议。
          </p>
          <p className="mb-4">2. 费用支付</p>
          <p className="mb-4">
            2.1 协心编辑器为付费软件，您可以通过以下方式获取付费服务：1）购买协心编辑器月会员或年会员；2）其他后续推出的付费项目。
          </p>
          <p className="mb-4">
            2.2 您的付款将通过第三方支付服务商进行处理，此类支付可能存在适用的附加条款。
          </p>
          <p className="mb-4">
            2.3 您同意：您的付款保证和我们的收款权利包括您必须缴纳的任何适用于您购买的付费服务的税收或其他费用的义务。
          </p>
          <p className="mb-4">
            2.4
            一旦完成支付，即视为购买了协心编辑器的按月或按年的付费服务，平台不支持任何形式的退款。
          </p>
          <p className="mb-4">3. 价格变更</p>
          <p className="mb-4">3.1 本公司保留修改协心编辑器服务定价的权利。</p>
          <p className="mb-4">
            3.2 此类通知会在协心编辑器网站上发布或通过【应用内站内信】的方式告知您。您将被视为已经收到在网站上发布的任何此类通知。
          </p>
          <p className="mb-4">
            3.3 如果您不同意支付新的价格，您可以选择不再继续购买会员。
          </p>
          <p className="mb-4">4. 退款</p>
          <p className="mb-4">
            4.1 本协议项下的所有应付款项均不可退还、不可抵扣。
          </p>
          <p className="mb-4">
            4.2 假如是因为您疏忽大意、忘记取消订阅等个人原因导致付费，我们没办法为您退款。
          </p>
          <p className="mb-4">5. 服务的中断和终止</p>
          <p className="mb-4">5.1 本协议将一直有效，直至您或本公司终止。</p>
          <p className="mb-4">
            5.2 我们可能出于任何原因（包括但不限于您违反本商业条款）立即终止或暂停您的帐户，而无需事先通知或承担任何责任。
          </p>
          <p className="mb-4">
            5.3 除非另有规定或适用法律另有要求，否则服务终止将不会导致任何退款。本协议终止后，您应停止使用本网站。
          </p>
          <p className="mb-4">
            5.4 如果您是已故者或法律上无民事行为能力的个人的合法授权代表并且有权处置该等个人的账号（该等个人已无可能重新使用其账号），您必须通过【应用内帮助与反馈-新反馈】通知我们，注明相关账号并提出取消付费服务的申请才能取消该等个人当前订阅的付费服务。如果您能充分证明您有权代表该个人并承担相应法律责任，并且您有能力验证相关付费服务采用的支付方法的详情，本公司将取消该付费服务订阅并注销账号。
          </p>
          <p className="mb-4">6. 订单与发票</p>
          <p className="mb-4">
            6.1 您在协心编辑器购买的付费服务的订单可在头像{">"}
            购买记录中查看，购买记录中会载明您所购买的服务信息、具体订单号、订单创建时间、您支付的金额。
          </p>
          <p className="mb-4">
            6.2 您可以在协心编辑器自助开具发票，请在网站中找到并加入写作交流群，与客服人员联系开具。
          </p>
          <p className="mb-4">7. 有限责任</p>
          <p className="mb-4">
            7.1 根据本条规定，本公司在本商业条款下的全部责任应限于您为协心编辑器实际支付的付费总额。
          </p>
          <p className="mb-4">
            7.2 本公司或其供应商在任何情况下都不对任何特殊损害、附带损害、间接损害承担赔偿责任，无论本公司或任何供应商是否已被告知此类损害的可能性，无论补救措施是否达到其目的。
          </p>
          <p className="mb-4">8. 免责声明</p>
          <p className="mb-4">
            8.1 我们将通过保密协议保障您在使用协心编辑器过程中的信息安全。您理解并同意，“协心编辑器”平台及相关服务是本公司在现有技术和条件范围内提供的。本公司将尽最大努力向您提供稳定、安全的服务。您理解本公司不能随时预见和防范技术风险或其他风险，包括但不限于不可抗力、网络原因、病毒、木马、黑客攻击、系统不稳定、政府行为、第三方服务瑕疵、第三方网站等原因可能导致的服务中断、数据丢失、不能正常使用本软件及服务以及其他的损失和风险。
          </p>
          <p className="mb-4">
            8.2 您理解并同意，为保障平台整体运营运营与安全，本公司有权根据具体情况决定服务和功能的范围，修改、中断、暂停或终止“协心编辑器”平台及相关服务。
          </p>
          <p className="mb-4">
            8.3 在适用法律允许的最大范围内，本公司代表其自身及其关联公司及其各自的许可方和服务提供商，明确拒绝就以下内容提供任何明示、暗示、法定或其他形式的保证。应用程序，包括对适销性、特定用途的适用性、所有权和不侵权的所有默示保证，以及可能在交易过程、履约过程、使用或贸易实践过程中产生的保证。在不限于上述规定的情况下，本公司不提供任何保证或承诺，也不就应用程序将满足您的要求、实现任何预期结果、兼容或与任何其他软件、应用程序、系统或服务一起工作、运行没有中断，符合任何性能或可靠性标准或没有错误或任何错误或缺陷可以或将被纠正。
          </p>
          <p className="mb-4">
            8.4 在不限制前述规定的情况下，本公司或本公司的任何供应商均不作出任何形式的明示或暗示的陈述或保证：
            (i) 关于应用程序的操作或可用性，或信息、内容和材料或产品包括在上面；
            (ii) 应用程序不会中断或没有错误； (iii)
            关于通过应用程序提供的任何信息或内容的准确性、可靠性或时效性； (iv)
            应用程序、其服务器、内容或从公司或代表公司发送的电子邮件没有病毒、脚本、特洛伊木马、蠕虫、恶意软件、定时炸弹或其他有害成分。
          </p>
          <p className="mb-4">
            8.5 您理解并同意，本软件及相关服务可能会受多种因素的影响或干扰，本公司不保证（包括但不限于）：
          </p>
          <p className="mb-4">
            (1) “协心编辑器”软件及服务完全适合用户的使用要求或令用户完全满意；
          </p>
          <p className="mb-4">
            (2) “协心编辑器”软件及服务不受干扰，及时、安全、可靠或不出现错误；用户经由本公司取得的任何产品、服务或其他材料符合用户的期望；
          </p>
          <p className="mb-4">(3) “协心编辑器”软件及服务中不出现任何错误。</p>
          <p className="mb-4">
            8.6 用户阅读、理解并同意，本协议是在保障遵守国家法律法规、维护公序良俗，保护他人合法权益的基础上实施，本公司在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证本公司判断完全与司法机关、行政机关的判断一致，如因此产生的后果用户已经理解并同意自行承担。
          </p>
          <p className="mb-4">
            8.7 在法律允许的范围内，本公司对以下情形导致的服务中断或受阻不承担责任：
          </p>
          <p className="mb-4">
            (1) 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
          </p>
          <p className="mb-4">
            (2) 用户或公司的电脑软件、系统、硬件和通信线路出现故障；
          </p>
          <p className="mb-4">
            (3) 用户操作不当或用户通过非公司授权的方式使用本服务；
          </p>
          <p className="mb-4">
            (4) 程序版本过时、设备的老化和/或其兼容性问题；
          </p>
          <p className="mb-4">(5) 其他本公司无法控制或合理预见的情形。</p>
          <p className="mb-4">
            8.8 您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，本公司不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：
          </p>
          <p className="mb-4">
            (1) 来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
          </p>
          <p className="mb-4">
            (2) 遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；
          </p>
          <p className="mb-4">(3) 其他因网络信息或用户行为引起的风险。</p>
          <p className="mb-4">
            8.9 本公司依据本协议约定获得处理违法违规内容的权利，该权利不构成本公司的义务或承诺，本公司不能保证及时发现违法行为或进行相应处理。
          </p>
          <p className="mb-4">
            8.10 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的信息。涉及财产操作的，请一定先核实对方身份，并请经常留意本公司有关防范诈骗犯罪的提示（如有）。
          </p>
          <p className="mb-4">9. 争议处理</p>
          <p className="mb-4">
            9.1 本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。如果本协议中的任何规定因与中华人民共和国的法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。
          </p>
          <p className="mb-4">
            9.2 您认可，我们有义务限制其员工的个人责任。您同意，对于您因使用服务而遭受的任何损失，本公司的员工将不承担任何赔偿责任。您同意不会就您适用服务中遭受的任何损失向我们的员工提出任何个人索赔。在不影响前述规定的情况下，您同意本协议中规定的担保和责任限制将保护我们的员工、代理人、子公司、继承人、受让人和分包商。
          </p>
          <p className="mb-4">
            9.3 您同意，任何仲裁将仅限于我们和单独用户之间的争议。您同意用户和我们各自放弃作为原告或集体成员参与任何集体诉讼或代表诉讼的权利。仲裁人员不得合并多个仲裁人的索赔进行仲裁，也不得主持任何形式的代表诉讼或集体诉讼。
          </p>
          <p className="mb-4">
            9.4 本商业条款由本协议正文及所有公司已经发布或将来可能发布的隐私政策、各项政策、规则、声明、通知、警示、提示、说明（以下简称“规则”）组成。本公司将以醒目的方式提供这些协议、规则供您查阅。一旦您开始使用上述网站，则视为您同时接受该网站公示的所有相关协议、规则的约束。本商业条款部分内容被有管辖权的法院认定为违法或无效的，不因此影响其他内容的效力。
          </p>
          <p className="mb-4">
            9.5 若您就本商业条款的内容或其执行有任何异议，您可以通过【应用内帮助与反馈-新反馈】或发送邮件到wwczzs@aiwaves.cn向我们提出；若您与我们发生任何争议，双方应尽量友好协商解决；协商不成时，您和我们一致同意交由杭州市余杭区人民法院通过诉讼解决。
          </p>
        </div>
      </div>
    </div>
  );
};
